#  -*- coding: utf-8 -*-
"""
Author: loong
Time: 2024/12/16 22:47
File: week_4_demo.py
Software: PyCharm
"""



#词典；每个词后方存储的是其词频，词频仅为示例，不会用到，也可自行修改
Dict = {"经常":0.1,
        "经":0.05,
        "有":0.1,
        "常":0.001,
        "有意见":0.1,
        "歧":0.001,
        "意见":0.2,
        "分歧":0.2,
        "见":0.05,
        "意":0.05,
        "见分歧":0.05,
        "分":0.1}

#待切分文本
sentence = "常经有意见分歧"

#实现全切分函数，输出根据字典能够切分出的所有的切分方式
def all_cut(sentence, Dict):
    target = []

    def backtrack(s, path):
        if s == len(sentence):
            target.append(path[:])
            return
        for end in range(s + len(sentence) +1 ):
            word = sentence[s:end]
            if word in Dict:
                path.append(word)
                backtrack(end, path)
                path.pop()
    backtrack(0, [])
    return target

#目标输出;顺序不重要
target = [
    ['经常', '有意见', '分歧'],
    ['经常', '有意见', '分', '歧'],
    ['经常', '有', '意见', '分歧'],
    ['经常', '有', '意见', '分', '歧'],
    ['经常', '有', '意', '见分歧'],
    ['经常', '有', '意', '见', '分歧'],
    ['经常', '有', '意', '见', '分', '歧'],
    ['经', '常', '有意见', '分歧'],
    ['经', '常', '有意见', '分', '歧'],
    ['经', '常', '有', '意见', '分歧'],
    ['经', '常', '有', '意见', '分', '歧'],
    ['经', '常', '有', '意', '见分歧'],
    ['经', '常', '有', '意', '见', '分歧'],
    ['经', '常', '有', '意', '见', '分', '歧']
]
if __name__ == '__main__':
    print(all_cut(sentence, Dict))
    """
    [['常', '经', '有', '意', '见', '分', '歧'],
     ['常', '经', '有', '意', '见', '分歧'], 
     ['常', '经', '有', '意', '见分歧'], 
     ['常', '经', '有', '意见', '分', '歧'], 
     ['常', '经', '有', '意见', '分歧'], 
     ['常', '经', '有意见', '分', '歧'], 
     ['常', '经', '有意见', '分歧']]

    """
