#week3作业

#词典；每个词后方存储的是其词频，词频仅为示例，不会用到，也可自行修改
Dict = {"经常":0.1,
        "经":0.05,
        "有":0.1,
        "常":0.001,
        "有意见":0.1,
        "歧":0.001,
        "意见":0.2,
        "分歧":0.2,
        "见":0.05,
        "意":0.05,
        "见分歧":0.05,
        "分":0.1}

#待切分文本
sentence = "经常有意见分歧"

#实现全切分函数，输出根据字典能够切分出的所有的切分方式
def all_cut(sentence, Dict):
   result = []    #目标列表
   i = 0     #循环序列
   n = len(sentence)   #序列长度值

   while i < n:
       value = 0    #value初始值
       word = ""    #字符存放的序列

       # 循环这个字符串，判断对应字符是否在Dict中
       for j in range(i + 1 , n + 1):
           word = sentence[i:j]
           if word in Dict and Dict[word] > value:
               sentence_word = word
               value = Dict[word]

       #如果字符不在Dict中，直接返回该值
       if sentence_word == "":
           sentence_word = sentence[i]

       #将检索到的字符追加到列表中
       result.append(sentence_word)

       #字符串的长度从已检索列表之后开始算起，继续循环
       i += len(sentence_word)

   return result

print(all_cut(sentence, Dict))

#目标输出;顺序不重要
target = [
    ['经常', '有意见', '分歧'],
    ['经常', '有意见', '分', '歧'],
    ['经常', '有', '意见', '分歧'],
    ['经常', '有', '意见', '分', '歧'],
    ['经常', '有', '意', '见分歧'],
    ['经常', '有', '意', '见', '分歧'],
    ['经常', '有', '意', '见', '分', '歧'],
    ['经', '常', '有意见', '分歧'],
    ['经', '常', '有意见', '分', '歧'],
    ['经', '常', '有', '意见', '分歧'],
    ['经', '常', '有', '意见', '分', '歧'],
    ['经', '常', '有', '意', '见分歧'],
    ['经', '常', '有', '意', '见', '分歧'],
    ['经', '常', '有', '意', '见', '分', '歧']
]

