#week3作业

#词典；每个词后方存储的是其词频，词频仅为示例，不会用到，也可自行修改
Dict = {"经常":0.1,
        '常有': 0,
        "经":0.05,
        "有":0.1,
        "常":0.001,
        "有意见":0.1,
        "歧":0.001,
        "意见":0.2,
        "分歧":0.2,
        "见":0.05,
        "意":0.05,
        "见分歧":0.05,
        "分":0.1}

#待切分文本
sentence = "经常有意见分歧"

#实现全切分函数，输出根据字典能够切分出的所有的切分方式
def all_cut(sentence, Dict):
  length = len(sentence)
  target = [[] for _ in range(length + 1)]
  target[0] = [[]]
  for i in range(1, length + 1):
    for j in range(i):
      # 获取所有的组合
      word = sentence[j:i]
      # 如果词在字典里
      if word in Dict:
        print(f'j={j}, i={i}, [word]={[word]}')
        print(f'j={j}, target[{j}] = {target[j]}')

        for k in target[j]:
          print(f'i={i}, j={j}, k={k}')

          # 对target[j]中的每一个切分方式，都加上当前词word
          target[i].append(k + [word])

          print(f'i={i}, target[{i}] = {target[i]}')
          print('--------------------------')
        print(f'target = {target}')
        print('==========================')
  
  print(target[-1])
  return target[-1]

#目标输出;顺序不重要
target = [
    ['经常', '有意见', '分歧'],
    ['经常', '有意见', '分', '歧'],
    ['经常', '有', '意见', '分歧'],
    ['经常', '有', '意见', '分', '歧'],
    ['经常', '有', '意', '见分歧'],
    ['经常', '有', '意', '见', '分歧'],
    ['经常', '有', '意', '见', '分', '歧'],
    ['经', '常', '有意见', '分歧'],
    ['经', '常', '有意见', '分', '歧'],
    ['经', '常', '有', '意见', '分歧'],
    ['经', '常', '有', '意见', '分', '歧'],
    ['经', '常', '有', '意', '见分歧'],
    ['经', '常', '有', '意', '见', '分歧'],
    ['经', '常', '有', '意', '见', '分', '歧']
]

all_cut(sentence, Dict)
